Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/usart.h
/**
 * \brief Header file for SAME/SAME70 USART
 *
 * Copyright (c) 2017-2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-06-05T16:39:35Z */
#ifndef SAME_SAME70_USART_MODULE_H
#define SAME_SAME70_USART_MODULE_H

/** \addtogroup SAME_SAME70 Universal Synchronous Asynchronous Receiver Transmitter
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SAME70_USART                                 */
/* ========================================================================== */

/* -------- US_CR : (USART Offset: 0x00) ( /W 32) Control Register -------- */
#define US_CR_RSTRX_Pos                       (2U)                                           /**< (US_CR) Reset Receiver Position */
#define US_CR_RSTRX_Msk                       (0x1U << US_CR_RSTRX_Pos)                      /**< (US_CR) Reset Receiver Mask */
#define US_CR_RSTRX(value)                    (US_CR_RSTRX_Msk & ((value) << US_CR_RSTRX_Pos))
#define US_CR_RSTTX_Pos                       (3U)                                           /**< (US_CR) Reset Transmitter Position */
#define US_CR_RSTTX_Msk                       (0x1U << US_CR_RSTTX_Pos)                      /**< (US_CR) Reset Transmitter Mask */
#define US_CR_RSTTX(value)                    (US_CR_RSTTX_Msk & ((value) << US_CR_RSTTX_Pos))
#define US_CR_RXEN_Pos                        (4U)                                           /**< (US_CR) Receiver Enable Position */
#define US_CR_RXEN_Msk                        (0x1U << US_CR_RXEN_Pos)                       /**< (US_CR) Receiver Enable Mask */
#define US_CR_RXEN(value)                     (US_CR_RXEN_Msk & ((value) << US_CR_RXEN_Pos))
#define US_CR_RXDIS_Pos                       (5U)                                           /**< (US_CR) Receiver Disable Position */
#define US_CR_RXDIS_Msk                       (0x1U << US_CR_RXDIS_Pos)                      /**< (US_CR) Receiver Disable Mask */
#define US_CR_RXDIS(value)                    (US_CR_RXDIS_Msk & ((value) << US_CR_RXDIS_Pos))
#define US_CR_TXEN_Pos                        (6U)                                           /**< (US_CR) Transmitter Enable Position */
#define US_CR_TXEN_Msk                        (0x1U << US_CR_TXEN_Pos)                       /**< (US_CR) Transmitter Enable Mask */
#define US_CR_TXEN(value)                     (US_CR_TXEN_Msk & ((value) << US_CR_TXEN_Pos))
#define US_CR_TXDIS_Pos                       (7U)                                           /**< (US_CR) Transmitter Disable Position */
#define US_CR_TXDIS_Msk                       (0x1U << US_CR_TXDIS_Pos)                      /**< (US_CR) Transmitter Disable Mask */
#define US_CR_TXDIS(value)                    (US_CR_TXDIS_Msk & ((value) << US_CR_TXDIS_Pos))
#define US_CR_RSTSTA_Pos                      (8U)                                           /**< (US_CR) Reset Status Bits Position */
#define US_CR_RSTSTA_Msk                      (0x1U << US_CR_RSTSTA_Pos)                     /**< (US_CR) Reset Status Bits Mask */
#define US_CR_RSTSTA(value)                   (US_CR_RSTSTA_Msk & ((value) << US_CR_RSTSTA_Pos))
#define US_CR_STTBRK_Pos                      (9U)                                           /**< (US_CR) Start Break Position */
#define US_CR_STTBRK_Msk                      (0x1U << US_CR_STTBRK_Pos)                     /**< (US_CR) Start Break Mask */
#define US_CR_STTBRK(value)                   (US_CR_STTBRK_Msk & ((value) << US_CR_STTBRK_Pos))
#define US_CR_STPBRK_Pos                      (10U)                                          /**< (US_CR) Stop Break Position */
#define US_CR_STPBRK_Msk                      (0x1U << US_CR_STPBRK_Pos)                     /**< (US_CR) Stop Break Mask */
#define US_CR_STPBRK(value)                   (US_CR_STPBRK_Msk & ((value) << US_CR_STPBRK_Pos))
#define US_CR_STTTO_Pos                       (11U)                                          /**< (US_CR) Clear TIMEOUT Flag and Start Timeout After Next Character Received Position */
#define US_CR_STTTO_Msk                       (0x1U << US_CR_STTTO_Pos)                      /**< (US_CR) Clear TIMEOUT Flag and Start Timeout After Next Character Received Mask */
#define US_CR_STTTO(value)                    (US_CR_STTTO_Msk & ((value) << US_CR_STTTO_Pos))
#define US_CR_SENDA_Pos                       (12U)                                          /**< (US_CR) Send Address Position */
#define US_CR_SENDA_Msk                       (0x1U << US_CR_SENDA_Pos)                      /**< (US_CR) Send Address Mask */
#define US_CR_SENDA(value)                    (US_CR_SENDA_Msk & ((value) << US_CR_SENDA_Pos))
#define US_CR_RSTIT_Pos                       (13U)                                          /**< (US_CR) Reset Iterations Position */
#define US_CR_RSTIT_Msk                       (0x1U << US_CR_RSTIT_Pos)                      /**< (US_CR) Reset Iterations Mask */
#define US_CR_RSTIT(value)                    (US_CR_RSTIT_Msk & ((value) << US_CR_RSTIT_Pos))
#define US_CR_RSTNACK_Pos                     (14U)                                          /**< (US_CR) Reset Non Acknowledge Position */
#define US_CR_RSTNACK_Msk                     (0x1U << US_CR_RSTNACK_Pos)                    /**< (US_CR) Reset Non Acknowledge Mask */
#define US_CR_RSTNACK(value)                  (US_CR_RSTNACK_Msk & ((value) << US_CR_RSTNACK_Pos))
#define US_CR_RETTO_Pos                       (15U)                                          /**< (US_CR) Start Timeout Immediately Position */
#define US_CR_RETTO_Msk                       (0x1U << US_CR_RETTO_Pos)                      /**< (US_CR) Start Timeout Immediately Mask */
#define US_CR_RETTO(value)                    (US_CR_RETTO_Msk & ((value) << US_CR_RETTO_Pos))
#define US_CR_DTREN_Pos                       (16U)                                          /**< (US_CR) Data Terminal Ready Enable Position */
#define US_CR_DTREN_Msk                       (0x1U << US_CR_DTREN_Pos)                      /**< (US_CR) Data Terminal Ready Enable Mask */
#define US_CR_DTREN(value)                    (US_CR_DTREN_Msk & ((value) << US_CR_DTREN_Pos))
#define US_CR_DTRDIS_Pos                      (17U)                                          /**< (US_CR) Data Terminal Ready Disable Position */
#define US_CR_DTRDIS_Msk                      (0x1U << US_CR_DTRDIS_Pos)                     /**< (US_CR) Data Terminal Ready Disable Mask */
#define US_CR_DTRDIS(value)                   (US_CR_DTRDIS_Msk & ((value) << US_CR_DTRDIS_Pos))
#define US_CR_RTSEN_Pos                       (18U)                                          /**< (US_CR) Request to Send Enable Position */
#define US_CR_RTSEN_Msk                       (0x1U << US_CR_RTSEN_Pos)                      /**< (US_CR) Request to Send Enable Mask */
#define US_CR_RTSEN(value)                    (US_CR_RTSEN_Msk & ((value) << US_CR_RTSEN_Pos))
#define US_CR_RTSDIS_Pos                      (19U)                                          /**< (US_CR) Request to Send Disable Position */
#define US_CR_RTSDIS_Msk                      (0x1U << US_CR_RTSDIS_Pos)                     /**< (US_CR) Request to Send Disable Mask */
#define US_CR_RTSDIS(value)                   (US_CR_RTSDIS_Msk & ((value) << US_CR_RTSDIS_Pos))
#define US_CR_LINABT_Pos                      (20U)                                          /**< (US_CR) Abort LIN Transmission Position */
#define US_CR_LINABT_Msk                      (0x1U << US_CR_LINABT_Pos)                     /**< (US_CR) Abort LIN Transmission Mask */
#define US_CR_LINABT(value)                   (US_CR_LINABT_Msk & ((value) << US_CR_LINABT_Pos))
#define US_CR_LINWKUP_Pos                     (21U)                                          /**< (US_CR) Send LIN Wakeup Signal Position */
#define US_CR_LINWKUP_Msk                     (0x1U << US_CR_LINWKUP_Pos)                    /**< (US_CR) Send LIN Wakeup Signal Mask */
#define US_CR_LINWKUP(value)                  (US_CR_LINWKUP_Msk & ((value) << US_CR_LINWKUP_Pos))
#define US_CR_FCS_Pos                         (18U)                                          /**< (US_CR) Force SPI Chip Select Position */
#define US_CR_FCS_Msk                         (0x1U << US_CR_FCS_Pos)                        /**< (US_CR) Force SPI Chip Select Mask */
#define US_CR_FCS(value)                      (US_CR_FCS_Msk & ((value) << US_CR_FCS_Pos))  
#define US_CR_RCS_Pos                         (19U)                                          /**< (US_CR) Release SPI Chip Select Position */
#define US_CR_RCS_Msk                         (0x1U << US_CR_RCS_Pos)                        /**< (US_CR) Release SPI Chip Select Mask */
#define US_CR_RCS(value)                      (US_CR_RCS_Msk & ((value) << US_CR_RCS_Pos))  
#define US_CR_Msk                             (0x003FFFFCUL)                                 /**< (US_CR) Register Mask  */

