Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/usart.h
/* -------- US_IDR : (USART Offset: 0x0C) ( /W 32) Interrupt Disable Register -------- */
#define US_IDR_RXRDY_Pos                      (0U)                                           /**< (US_IDR) RXRDY Interrupt Disable Position */
#define US_IDR_RXRDY_Msk                      (0x1U << US_IDR_RXRDY_Pos)                     /**< (US_IDR) RXRDY Interrupt Disable Mask */
#define US_IDR_RXRDY(value)                   (US_IDR_RXRDY_Msk & ((value) << US_IDR_RXRDY_Pos))
#define US_IDR_TXRDY_Pos                      (1U)                                           /**< (US_IDR) TXRDY Interrupt Disable Position */
#define US_IDR_TXRDY_Msk                      (0x1U << US_IDR_TXRDY_Pos)                     /**< (US_IDR) TXRDY Interrupt Disable Mask */
#define US_IDR_TXRDY(value)                   (US_IDR_TXRDY_Msk & ((value) << US_IDR_TXRDY_Pos))
#define US_IDR_RXBRK_Pos                      (2U)                                           /**< (US_IDR) Receiver Break Interrupt Disable Position */
#define US_IDR_RXBRK_Msk                      (0x1U << US_IDR_RXBRK_Pos)                     /**< (US_IDR) Receiver Break Interrupt Disable Mask */
#define US_IDR_RXBRK(value)                   (US_IDR_RXBRK_Msk & ((value) << US_IDR_RXBRK_Pos))
#define US_IDR_OVRE_Pos                       (5U)                                           /**< (US_IDR) Overrun Error Interrupt Enable Position */
#define US_IDR_OVRE_Msk                       (0x1U << US_IDR_OVRE_Pos)                      /**< (US_IDR) Overrun Error Interrupt Enable Mask */
#define US_IDR_OVRE(value)                    (US_IDR_OVRE_Msk & ((value) << US_IDR_OVRE_Pos))
#define US_IDR_FRAME_Pos                      (6U)                                           /**< (US_IDR) Framing Error Interrupt Disable Position */
#define US_IDR_FRAME_Msk                      (0x1U << US_IDR_FRAME_Pos)                     /**< (US_IDR) Framing Error Interrupt Disable Mask */
#define US_IDR_FRAME(value)                   (US_IDR_FRAME_Msk & ((value) << US_IDR_FRAME_Pos))
#define US_IDR_PARE_Pos                       (7U)                                           /**< (US_IDR) Parity Error Interrupt Disable Position */
#define US_IDR_PARE_Msk                       (0x1U << US_IDR_PARE_Pos)                      /**< (US_IDR) Parity Error Interrupt Disable Mask */
#define US_IDR_PARE(value)                    (US_IDR_PARE_Msk & ((value) << US_IDR_PARE_Pos))
#define US_IDR_TIMEOUT_Pos                    (8U)                                           /**< (US_IDR) Timeout Interrupt Disable Position */
#define US_IDR_TIMEOUT_Msk                    (0x1U << US_IDR_TIMEOUT_Pos)                   /**< (US_IDR) Timeout Interrupt Disable Mask */
#define US_IDR_TIMEOUT(value)                 (US_IDR_TIMEOUT_Msk & ((value) << US_IDR_TIMEOUT_Pos))
#define US_IDR_TXEMPTY_Pos                    (9U)                                           /**< (US_IDR) TXEMPTY Interrupt Disable Position */
#define US_IDR_TXEMPTY_Msk                    (0x1U << US_IDR_TXEMPTY_Pos)                   /**< (US_IDR) TXEMPTY Interrupt Disable Mask */
#define US_IDR_TXEMPTY(value)                 (US_IDR_TXEMPTY_Msk & ((value) << US_IDR_TXEMPTY_Pos))
#define US_IDR_ITER_Pos                       (10U)                                          /**< (US_IDR) Max Number of Repetitions Reached Interrupt Disable Position */
#define US_IDR_ITER_Msk                       (0x1U << US_IDR_ITER_Pos)                      /**< (US_IDR) Max Number of Repetitions Reached Interrupt Disable Mask */
#define US_IDR_ITER(value)                    (US_IDR_ITER_Msk & ((value) << US_IDR_ITER_Pos))
#define US_IDR_NACK_Pos                       (13U)                                          /**< (US_IDR) Non Acknowledge Interrupt Disable Position */
#define US_IDR_NACK_Msk                       (0x1U << US_IDR_NACK_Pos)                      /**< (US_IDR) Non Acknowledge Interrupt Disable Mask */
#define US_IDR_NACK(value)                    (US_IDR_NACK_Msk & ((value) << US_IDR_NACK_Pos))
#define US_IDR_RIIC_Pos                       (16U)                                          /**< (US_IDR) Ring Indicator Input Change Disable Position */
#define US_IDR_RIIC_Msk                       (0x1U << US_IDR_RIIC_Pos)                      /**< (US_IDR) Ring Indicator Input Change Disable Mask */
#define US_IDR_RIIC(value)                    (US_IDR_RIIC_Msk & ((value) << US_IDR_RIIC_Pos))
#define US_IDR_DSRIC_Pos                      (17U)                                          /**< (US_IDR) Data Set Ready Input Change Disable Position */
#define US_IDR_DSRIC_Msk                      (0x1U << US_IDR_DSRIC_Pos)                     /**< (US_IDR) Data Set Ready Input Change Disable Mask */
#define US_IDR_DSRIC(value)                   (US_IDR_DSRIC_Msk & ((value) << US_IDR_DSRIC_Pos))
#define US_IDR_DCDIC_Pos                      (18U)                                          /**< (US_IDR) Data Carrier Detect Input Change Interrupt Disable Position */
#define US_IDR_DCDIC_Msk                      (0x1U << US_IDR_DCDIC_Pos)                     /**< (US_IDR) Data Carrier Detect Input Change Interrupt Disable Mask */
#define US_IDR_DCDIC(value)                   (US_IDR_DCDIC_Msk & ((value) << US_IDR_DCDIC_Pos))
#define US_IDR_CTSIC_Pos                      (19U)                                          /**< (US_IDR) Clear to Send Input Change Interrupt Disable Position */
#define US_IDR_CTSIC_Msk                      (0x1U << US_IDR_CTSIC_Pos)                     /**< (US_IDR) Clear to Send Input Change Interrupt Disable Mask */
#define US_IDR_CTSIC(value)                   (US_IDR_CTSIC_Msk & ((value) << US_IDR_CTSIC_Pos))
#define US_IDR_MANE_Pos                       (24U)                                          /**< (US_IDR) Manchester Error Interrupt Disable Position */
#define US_IDR_MANE_Msk                       (0x1U << US_IDR_MANE_Pos)                      /**< (US_IDR) Manchester Error Interrupt Disable Mask */
#define US_IDR_MANE(value)                    (US_IDR_MANE_Msk & ((value) << US_IDR_MANE_Pos))
#define US_IDR_UNRE_Pos                       (10U)                                          /**< (US_IDR) SPI Underrun Error Interrupt Disable Position */
#define US_IDR_UNRE_Msk                       (0x1U << US_IDR_UNRE_Pos)                      /**< (US_IDR) SPI Underrun Error Interrupt Disable Mask */
#define US_IDR_UNRE(value)                    (US_IDR_UNRE_Msk & ((value) << US_IDR_UNRE_Pos))
#define US_IDR_NSSE_Pos                       (19U)                                          /**< (US_IDR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_IDR_NSSE_Msk                       (0x1U << US_IDR_NSSE_Pos)                      /**< (US_IDR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
#define US_IDR_NSSE(value)                    (US_IDR_NSSE_Msk & ((value) << US_IDR_NSSE_Pos))
#define US_IDR_LINBK_Pos                      (13U)                                          /**< (US_IDR) LIN Break Sent or LIN Break Received Interrupt Disable Position */
#define US_IDR_LINBK_Msk                      (0x1U << US_IDR_LINBK_Pos)                     /**< (US_IDR) LIN Break Sent or LIN Break Received Interrupt Disable Mask */
#define US_IDR_LINBK(value)                   (US_IDR_LINBK_Msk & ((value) << US_IDR_LINBK_Pos))
#define US_IDR_LINID_Pos                      (14U)                                          /**< (US_IDR) LIN Identifier Sent or LIN Identifier Received Interrupt Disable Position */
#define US_IDR_LINID_Msk                      (0x1U << US_IDR_LINID_Pos)                     /**< (US_IDR) LIN Identifier Sent or LIN Identifier Received Interrupt Disable Mask */
#define US_IDR_LINID(value)                   (US_IDR_LINID_Msk & ((value) << US_IDR_LINID_Pos))
#define US_IDR_LINTC_Pos                      (15U)                                          /**< (US_IDR) LIN Transfer Completed Interrupt Disable Position */
#define US_IDR_LINTC_Msk                      (0x1U << US_IDR_LINTC_Pos)                     /**< (US_IDR) LIN Transfer Completed Interrupt Disable Mask */
#define US_IDR_LINTC(value)                   (US_IDR_LINTC_Msk & ((value) << US_IDR_LINTC_Pos))
#define US_IDR_LINBE_Pos                      (25U)                                          /**< (US_IDR) LIN Bus Error Interrupt Disable Position */
#define US_IDR_LINBE_Msk                      (0x1U << US_IDR_LINBE_Pos)                     /**< (US_IDR) LIN Bus Error Interrupt Disable Mask */
#define US_IDR_LINBE(value)                   (US_IDR_LINBE_Msk & ((value) << US_IDR_LINBE_Pos))
#define US_IDR_LINISFE_Pos                    (26U)                                          /**< (US_IDR) LIN Inconsistent Synch Field Error Interrupt Disable Position */
#define US_IDR_LINISFE_Msk                    (0x1U << US_IDR_LINISFE_Pos)                   /**< (US_IDR) LIN Inconsistent Synch Field Error Interrupt Disable Mask */
#define US_IDR_LINISFE(value)                 (US_IDR_LINISFE_Msk & ((value) << US_IDR_LINISFE_Pos))
#define US_IDR_LINIPE_Pos                     (27U)                                          /**< (US_IDR) LIN Identifier Parity Interrupt Disable Position */
#define US_IDR_LINIPE_Msk                     (0x1U << US_IDR_LINIPE_Pos)                    /**< (US_IDR) LIN Identifier Parity Interrupt Disable Mask */
#define US_IDR_LINIPE(value)                  (US_IDR_LINIPE_Msk & ((value) << US_IDR_LINIPE_Pos))
#define US_IDR_LINCE_Pos                      (28U)                                          /**< (US_IDR) LIN Checksum Error Interrupt Disable Position */
#define US_IDR_LINCE_Msk                      (0x1U << US_IDR_LINCE_Pos)                     /**< (US_IDR) LIN Checksum Error Interrupt Disable Mask */
#define US_IDR_LINCE(value)                   (US_IDR_LINCE_Msk & ((value) << US_IDR_LINCE_Pos))
#define US_IDR_LINSNRE_Pos                    (29U)                                          /**< (US_IDR) LIN Slave Not Responding Error Interrupt Disable Position */
#define US_IDR_LINSNRE_Msk                    (0x1U << US_IDR_LINSNRE_Pos)                   /**< (US_IDR) LIN Slave Not Responding Error Interrupt Disable Mask */
#define US_IDR_LINSNRE(value)                 (US_IDR_LINSNRE_Msk & ((value) << US_IDR_LINSNRE_Pos))
#define US_IDR_LINSTE_Pos                     (30U)                                          /**< (US_IDR) LIN Synch Tolerance Error Interrupt Disable Position */
#define US_IDR_LINSTE_Msk                     (0x1U << US_IDR_LINSTE_Pos)                    /**< (US_IDR) LIN Synch Tolerance Error Interrupt Disable Mask */
#define US_IDR_LINSTE(value)                  (US_IDR_LINSTE_Msk & ((value) << US_IDR_LINSTE_Pos))
#define US_IDR_LINHTE_Pos                     (31U)                                          /**< (US_IDR) LIN Header Timeout Error Interrupt Disable Position */
#define US_IDR_LINHTE_Msk                     (0x1U << US_IDR_LINHTE_Pos)                    /**< (US_IDR) LIN Header Timeout Error Interrupt Disable Mask */
#define US_IDR_LINHTE(value)                  (US_IDR_LINHTE_Msk & ((value) << US_IDR_LINHTE_Pos))
#define US_IDR_LSFE_Pos                       (6U)                                           /**< (US_IDR) LON Short Frame Error Interrupt Disable Position */
#define US_IDR_LSFE_Msk                       (0x1U << US_IDR_LSFE_Pos)                      /**< (US_IDR) LON Short Frame Error Interrupt Disable Mask */
#define US_IDR_LSFE(value)                    (US_IDR_LSFE_Msk & ((value) << US_IDR_LSFE_Pos))
#define US_IDR_LCRCE_Pos                      (7U)                                           /**< (US_IDR) LON CRC Error Interrupt Disable Position */
#define US_IDR_LCRCE_Msk                      (0x1U << US_IDR_LCRCE_Pos)                     /**< (US_IDR) LON CRC Error Interrupt Disable Mask */
#define US_IDR_LCRCE(value)                   (US_IDR_LCRCE_Msk & ((value) << US_IDR_LCRCE_Pos))
#define US_IDR_LTXD_Pos                       (24U)                                          /**< (US_IDR) LON Transmission Done Interrupt Disable Position */
#define US_IDR_LTXD_Msk                       (0x1U << US_IDR_LTXD_Pos)                      /**< (US_IDR) LON Transmission Done Interrupt Disable Mask */
#define US_IDR_LTXD(value)                    (US_IDR_LTXD_Msk & ((value) << US_IDR_LTXD_Pos))
#define US_IDR_LCOL_Pos                       (25U)                                          /**< (US_IDR) LON Collision Interrupt Disable Position */
#define US_IDR_LCOL_Msk                       (0x1U << US_IDR_LCOL_Pos)                      /**< (US_IDR) LON Collision Interrupt Disable Mask */
#define US_IDR_LCOL(value)                    (US_IDR_LCOL_Msk & ((value) << US_IDR_LCOL_Pos))
#define US_IDR_LFET_Pos                       (26U)                                          /**< (US_IDR) LON Frame Early Termination Interrupt Disable Position */
#define US_IDR_LFET_Msk                       (0x1U << US_IDR_LFET_Pos)                      /**< (US_IDR) LON Frame Early Termination Interrupt Disable Mask */
#define US_IDR_LFET(value)                    (US_IDR_LFET_Msk & ((value) << US_IDR_LFET_Pos))
#define US_IDR_LRXD_Pos                       (27U)                                          /**< (US_IDR) LON Reception Done Interrupt Disable Position */
#define US_IDR_LRXD_Msk                       (0x1U << US_IDR_LRXD_Pos)                      /**< (US_IDR) LON Reception Done Interrupt Disable Mask */
#define US_IDR_LRXD(value)                    (US_IDR_LRXD_Msk & ((value) << US_IDR_LRXD_Pos))
#define US_IDR_LBLOVFE_Pos                    (28U)                                          /**< (US_IDR) LON Backlog Overflow Error Interrupt Disable Position */
#define US_IDR_LBLOVFE_Msk                    (0x1U << US_IDR_LBLOVFE_Pos)                   /**< (US_IDR) LON Backlog Overflow Error Interrupt Disable Mask */
#define US_IDR_LBLOVFE(value)                 (US_IDR_LBLOVFE_Msk & ((value) << US_IDR_LBLOVFE_Pos))
#define US_IDR_Msk                            (0xFF0FE7E7UL)                                 /**< (US_IDR) Register Mask  */

