Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/usart.h
/* -------- US_IMR : (USART Offset: 0x10) (R/  32) Interrupt Mask Register -------- */
#define US_IMR_RXRDY_Pos                      (0U)                                           /**< (US_IMR) RXRDY Interrupt Mask Position */
#define US_IMR_RXRDY_Msk                      (0x1U << US_IMR_RXRDY_Pos)                     /**< (US_IMR) RXRDY Interrupt Mask Mask */
#define US_IMR_RXRDY(value)                   (US_IMR_RXRDY_Msk & ((value) << US_IMR_RXRDY_Pos))
#define US_IMR_TXRDY_Pos                      (1U)                                           /**< (US_IMR) TXRDY Interrupt Mask Position */
#define US_IMR_TXRDY_Msk                      (0x1U << US_IMR_TXRDY_Pos)                     /**< (US_IMR) TXRDY Interrupt Mask Mask */
#define US_IMR_TXRDY(value)                   (US_IMR_TXRDY_Msk & ((value) << US_IMR_TXRDY_Pos))
#define US_IMR_RXBRK_Pos                      (2U)                                           /**< (US_IMR) Receiver Break Interrupt Mask Position */
#define US_IMR_RXBRK_Msk                      (0x1U << US_IMR_RXBRK_Pos)                     /**< (US_IMR) Receiver Break Interrupt Mask Mask */
#define US_IMR_RXBRK(value)                   (US_IMR_RXBRK_Msk & ((value) << US_IMR_RXBRK_Pos))
#define US_IMR_OVRE_Pos                       (5U)                                           /**< (US_IMR) Overrun Error Interrupt Mask Position */
#define US_IMR_OVRE_Msk                       (0x1U << US_IMR_OVRE_Pos)                      /**< (US_IMR) Overrun Error Interrupt Mask Mask */
#define US_IMR_OVRE(value)                    (US_IMR_OVRE_Msk & ((value) << US_IMR_OVRE_Pos))
#define US_IMR_FRAME_Pos                      (6U)                                           /**< (US_IMR) Framing Error Interrupt Mask Position */
#define US_IMR_FRAME_Msk                      (0x1U << US_IMR_FRAME_Pos)                     /**< (US_IMR) Framing Error Interrupt Mask Mask */
#define US_IMR_FRAME(value)                   (US_IMR_FRAME_Msk & ((value) << US_IMR_FRAME_Pos))
#define US_IMR_PARE_Pos                       (7U)                                           /**< (US_IMR) Parity Error Interrupt Mask Position */
#define US_IMR_PARE_Msk                       (0x1U << US_IMR_PARE_Pos)                      /**< (US_IMR) Parity Error Interrupt Mask Mask */
#define US_IMR_PARE(value)                    (US_IMR_PARE_Msk & ((value) << US_IMR_PARE_Pos))
#define US_IMR_TIMEOUT_Pos                    (8U)                                           /**< (US_IMR) Timeout Interrupt Mask Position */
#define US_IMR_TIMEOUT_Msk                    (0x1U << US_IMR_TIMEOUT_Pos)                   /**< (US_IMR) Timeout Interrupt Mask Mask */
#define US_IMR_TIMEOUT(value)                 (US_IMR_TIMEOUT_Msk & ((value) << US_IMR_TIMEOUT_Pos))
#define US_IMR_TXEMPTY_Pos                    (9U)                                           /**< (US_IMR) TXEMPTY Interrupt Mask Position */
#define US_IMR_TXEMPTY_Msk                    (0x1U << US_IMR_TXEMPTY_Pos)                   /**< (US_IMR) TXEMPTY Interrupt Mask Mask */
#define US_IMR_TXEMPTY(value)                 (US_IMR_TXEMPTY_Msk & ((value) << US_IMR_TXEMPTY_Pos))
#define US_IMR_ITER_Pos                       (10U)                                          /**< (US_IMR) Max Number of Repetitions Reached Interrupt Mask Position */
#define US_IMR_ITER_Msk                       (0x1U << US_IMR_ITER_Pos)                      /**< (US_IMR) Max Number of Repetitions Reached Interrupt Mask Mask */
#define US_IMR_ITER(value)                    (US_IMR_ITER_Msk & ((value) << US_IMR_ITER_Pos))
#define US_IMR_NACK_Pos                       (13U)                                          /**< (US_IMR) Non Acknowledge Interrupt Mask Position */
#define US_IMR_NACK_Msk                       (0x1U << US_IMR_NACK_Pos)                      /**< (US_IMR) Non Acknowledge Interrupt Mask Mask */
#define US_IMR_NACK(value)                    (US_IMR_NACK_Msk & ((value) << US_IMR_NACK_Pos))
#define US_IMR_RIIC_Pos                       (16U)                                          /**< (US_IMR) Ring Indicator Input Change Mask Position */
#define US_IMR_RIIC_Msk                       (0x1U << US_IMR_RIIC_Pos)                      /**< (US_IMR) Ring Indicator Input Change Mask Mask */
#define US_IMR_RIIC(value)                    (US_IMR_RIIC_Msk & ((value) << US_IMR_RIIC_Pos))
#define US_IMR_DSRIC_Pos                      (17U)                                          /**< (US_IMR) Data Set Ready Input Change Mask Position */
#define US_IMR_DSRIC_Msk                      (0x1U << US_IMR_DSRIC_Pos)                     /**< (US_IMR) Data Set Ready Input Change Mask Mask */
#define US_IMR_DSRIC(value)                   (US_IMR_DSRIC_Msk & ((value) << US_IMR_DSRIC_Pos))
#define US_IMR_DCDIC_Pos                      (18U)                                          /**< (US_IMR) Data Carrier Detect Input Change Interrupt Mask Position */
#define US_IMR_DCDIC_Msk                      (0x1U << US_IMR_DCDIC_Pos)                     /**< (US_IMR) Data Carrier Detect Input Change Interrupt Mask Mask */
#define US_IMR_DCDIC(value)                   (US_IMR_DCDIC_Msk & ((value) << US_IMR_DCDIC_Pos))
#define US_IMR_CTSIC_Pos                      (19U)                                          /**< (US_IMR) Clear to Send Input Change Interrupt Mask Position */
#define US_IMR_CTSIC_Msk                      (0x1U << US_IMR_CTSIC_Pos)                     /**< (US_IMR) Clear to Send Input Change Interrupt Mask Mask */
#define US_IMR_CTSIC(value)                   (US_IMR_CTSIC_Msk & ((value) << US_IMR_CTSIC_Pos))
#define US_IMR_MANE_Pos                       (24U)                                          /**< (US_IMR) Manchester Error Interrupt Mask Position */
#define US_IMR_MANE_Msk                       (0x1U << US_IMR_MANE_Pos)                      /**< (US_IMR) Manchester Error Interrupt Mask Mask */
#define US_IMR_MANE(value)                    (US_IMR_MANE_Msk & ((value) << US_IMR_MANE_Pos))
#define US_IMR_UNRE_Pos                       (10U)                                          /**< (US_IMR) SPI Underrun Error Interrupt Mask Position */
#define US_IMR_UNRE_Msk                       (0x1U << US_IMR_UNRE_Pos)                      /**< (US_IMR) SPI Underrun Error Interrupt Mask Mask */
#define US_IMR_UNRE(value)                    (US_IMR_UNRE_Msk & ((value) << US_IMR_UNRE_Pos))
#define US_IMR_NSSE_Pos                       (19U)                                          /**< (US_IMR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_IMR_NSSE_Msk                       (0x1U << US_IMR_NSSE_Pos)                      /**< (US_IMR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
#define US_IMR_NSSE(value)                    (US_IMR_NSSE_Msk & ((value) << US_IMR_NSSE_Pos))
#define US_IMR_LINBK_Pos                      (13U)                                          /**< (US_IMR) LIN Break Sent or LIN Break Received Interrupt Mask Position */
#define US_IMR_LINBK_Msk                      (0x1U << US_IMR_LINBK_Pos)                     /**< (US_IMR) LIN Break Sent or LIN Break Received Interrupt Mask Mask */
#define US_IMR_LINBK(value)                   (US_IMR_LINBK_Msk & ((value) << US_IMR_LINBK_Pos))
#define US_IMR_LINID_Pos                      (14U)                                          /**< (US_IMR) LIN Identifier Sent or LIN Identifier Received Interrupt Mask Position */
#define US_IMR_LINID_Msk                      (0x1U << US_IMR_LINID_Pos)                     /**< (US_IMR) LIN Identifier Sent or LIN Identifier Received Interrupt Mask Mask */
#define US_IMR_LINID(value)                   (US_IMR_LINID_Msk & ((value) << US_IMR_LINID_Pos))
#define US_IMR_LINTC_Pos                      (15U)                                          /**< (US_IMR) LIN Transfer Completed Interrupt Mask Position */
#define US_IMR_LINTC_Msk                      (0x1U << US_IMR_LINTC_Pos)                     /**< (US_IMR) LIN Transfer Completed Interrupt Mask Mask */
#define US_IMR_LINTC(value)                   (US_IMR_LINTC_Msk & ((value) << US_IMR_LINTC_Pos))
#define US_IMR_LINBE_Pos                      (25U)                                          /**< (US_IMR) LIN Bus Error Interrupt Mask Position */
#define US_IMR_LINBE_Msk                      (0x1U << US_IMR_LINBE_Pos)                     /**< (US_IMR) LIN Bus Error Interrupt Mask Mask */
#define US_IMR_LINBE(value)                   (US_IMR_LINBE_Msk & ((value) << US_IMR_LINBE_Pos))
#define US_IMR_LINISFE_Pos                    (26U)                                          /**< (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask Position */
#define US_IMR_LINISFE_Msk                    (0x1U << US_IMR_LINISFE_Pos)                   /**< (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask Mask */
#define US_IMR_LINISFE(value)                 (US_IMR_LINISFE_Msk & ((value) << US_IMR_LINISFE_Pos))
#define US_IMR_LINIPE_Pos                     (27U)                                          /**< (US_IMR) LIN Identifier Parity Interrupt Mask Position */
#define US_IMR_LINIPE_Msk                     (0x1U << US_IMR_LINIPE_Pos)                    /**< (US_IMR) LIN Identifier Parity Interrupt Mask Mask */
#define US_IMR_LINIPE(value)                  (US_IMR_LINIPE_Msk & ((value) << US_IMR_LINIPE_Pos))
#define US_IMR_LINCE_Pos                      (28U)                                          /**< (US_IMR) LIN Checksum Error Interrupt Mask Position */
#define US_IMR_LINCE_Msk                      (0x1U << US_IMR_LINCE_Pos)                     /**< (US_IMR) LIN Checksum Error Interrupt Mask Mask */
#define US_IMR_LINCE(value)                   (US_IMR_LINCE_Msk & ((value) << US_IMR_LINCE_Pos))
#define US_IMR_LINSNRE_Pos                    (29U)                                          /**< (US_IMR) LIN Slave Not Responding Error Interrupt Mask Position */
#define US_IMR_LINSNRE_Msk                    (0x1U << US_IMR_LINSNRE_Pos)                   /**< (US_IMR) LIN Slave Not Responding Error Interrupt Mask Mask */
#define US_IMR_LINSNRE(value)                 (US_IMR_LINSNRE_Msk & ((value) << US_IMR_LINSNRE_Pos))
#define US_IMR_LINSTE_Pos                     (30U)                                          /**< (US_IMR) LIN Synch Tolerance Error Interrupt Mask Position */
#define US_IMR_LINSTE_Msk                     (0x1U << US_IMR_LINSTE_Pos)                    /**< (US_IMR) LIN Synch Tolerance Error Interrupt Mask Mask */
#define US_IMR_LINSTE(value)                  (US_IMR_LINSTE_Msk & ((value) << US_IMR_LINSTE_Pos))
#define US_IMR_LINHTE_Pos                     (31U)                                          /**< (US_IMR) LIN Header Timeout Error Interrupt Mask Position */
#define US_IMR_LINHTE_Msk                     (0x1U << US_IMR_LINHTE_Pos)                    /**< (US_IMR) LIN Header Timeout Error Interrupt Mask Mask */
#define US_IMR_LINHTE(value)                  (US_IMR_LINHTE_Msk & ((value) << US_IMR_LINHTE_Pos))
#define US_IMR_LSFE_Pos                       (6U)                                           /**< (US_IMR) LON Short Frame Error Interrupt Mask Position */
#define US_IMR_LSFE_Msk                       (0x1U << US_IMR_LSFE_Pos)                      /**< (US_IMR) LON Short Frame Error Interrupt Mask Mask */
#define US_IMR_LSFE(value)                    (US_IMR_LSFE_Msk & ((value) << US_IMR_LSFE_Pos))
#define US_IMR_LCRCE_Pos                      (7U)                                           /**< (US_IMR) LON CRC Error Interrupt Mask Position */
#define US_IMR_LCRCE_Msk                      (0x1U << US_IMR_LCRCE_Pos)                     /**< (US_IMR) LON CRC Error Interrupt Mask Mask */
#define US_IMR_LCRCE(value)                   (US_IMR_LCRCE_Msk & ((value) << US_IMR_LCRCE_Pos))
#define US_IMR_LTXD_Pos                       (24U)                                          /**< (US_IMR) LON Transmission Done Interrupt Mask Position */
#define US_IMR_LTXD_Msk                       (0x1U << US_IMR_LTXD_Pos)                      /**< (US_IMR) LON Transmission Done Interrupt Mask Mask */
#define US_IMR_LTXD(value)                    (US_IMR_LTXD_Msk & ((value) << US_IMR_LTXD_Pos))
#define US_IMR_LCOL_Pos                       (25U)                                          /**< (US_IMR) LON Collision Interrupt Mask Position */
#define US_IMR_LCOL_Msk                       (0x1U << US_IMR_LCOL_Pos)                      /**< (US_IMR) LON Collision Interrupt Mask Mask */
#define US_IMR_LCOL(value)                    (US_IMR_LCOL_Msk & ((value) << US_IMR_LCOL_Pos))
#define US_IMR_LFET_Pos                       (26U)                                          /**< (US_IMR) LON Frame Early Termination Interrupt Mask Position */
#define US_IMR_LFET_Msk                       (0x1U << US_IMR_LFET_Pos)                      /**< (US_IMR) LON Frame Early Termination Interrupt Mask Mask */
#define US_IMR_LFET(value)                    (US_IMR_LFET_Msk & ((value) << US_IMR_LFET_Pos))
#define US_IMR_LRXD_Pos                       (27U)                                          /**< (US_IMR) LON Reception Done Interrupt Mask Position */
#define US_IMR_LRXD_Msk                       (0x1U << US_IMR_LRXD_Pos)                      /**< (US_IMR) LON Reception Done Interrupt Mask Mask */
#define US_IMR_LRXD(value)                    (US_IMR_LRXD_Msk & ((value) << US_IMR_LRXD_Pos))
#define US_IMR_LBLOVFE_Pos                    (28U)                                          /**< (US_IMR) LON Backlog Overflow Error Interrupt Mask Position */
#define US_IMR_LBLOVFE_Msk                    (0x1U << US_IMR_LBLOVFE_Pos)                   /**< (US_IMR) LON Backlog Overflow Error Interrupt Mask Mask */
#define US_IMR_LBLOVFE(value)                 (US_IMR_LBLOVFE_Msk & ((value) << US_IMR_LBLOVFE_Pos))
#define US_IMR_Msk                            (0xFF0FE7E7UL)                                 /**< (US_IMR) Register Mask  */

