Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/usart.h
/* -------- US_LONPR : (USART Offset: 0x64) (R/W 32) LON Preamble Register -------- */
#define US_LONPR_LONPL_Pos                    (0U)                                           /**< (US_LONPR) LON Preamble Length Position */
#define US_LONPR_LONPL_Msk                    (0x3FFFU << US_LONPR_LONPL_Pos)                /**< (US_LONPR) LON Preamble Length Mask */
#define US_LONPR_LONPL(value)                 (US_LONPR_LONPL_Msk & ((value) << US_LONPR_LONPL_Pos))
#define US_LONPR_Msk                          (0x00003FFFUL)                                 /**< (US_LONPR) Register Mask  */

/* -------- US_LONDL : (USART Offset: 0x68) (R/W 32) LON Data Length Register -------- */
#define US_LONDL_LONDL_Pos                    (0U)                                           /**< (US_LONDL) LON Data Length Position */
#define US_LONDL_LONDL_Msk                    (0xFFU << US_LONDL_LONDL_Pos)                  /**< (US_LONDL) LON Data Length Mask */
#define US_LONDL_LONDL(value)                 (US_LONDL_LONDL_Msk & ((value) << US_LONDL_LONDL_Pos))
#define US_LONDL_Msk                          (0x000000FFUL)                                 /**< (US_LONDL) Register Mask  */

/* -------- US_LONL2HDR : (USART Offset: 0x6C) (R/W 32) LON L2HDR Register -------- */
#define US_LONL2HDR_BLI_Pos                   (0U)                                           /**< (US_LONL2HDR) LON Backlog Increment Position */
#define US_LONL2HDR_BLI_Msk                   (0x3FU << US_LONL2HDR_BLI_Pos)                 /**< (US_LONL2HDR) LON Backlog Increment Mask */
#define US_LONL2HDR_BLI(value)                (US_LONL2HDR_BLI_Msk & ((value) << US_LONL2HDR_BLI_Pos))
#define US_LONL2HDR_ALTP_Pos                  (6U)                                           /**< (US_LONL2HDR) LON Alternate Path Bit Position */
#define US_LONL2HDR_ALTP_Msk                  (0x1U << US_LONL2HDR_ALTP_Pos)                 /**< (US_LONL2HDR) LON Alternate Path Bit Mask */
#define US_LONL2HDR_ALTP(value)               (US_LONL2HDR_ALTP_Msk & ((value) << US_LONL2HDR_ALTP_Pos))
#define US_LONL2HDR_PB_Pos                    (7U)                                           /**< (US_LONL2HDR) LON Priority Bit Position */
#define US_LONL2HDR_PB_Msk                    (0x1U << US_LONL2HDR_PB_Pos)                   /**< (US_LONL2HDR) LON Priority Bit Mask */
#define US_LONL2HDR_PB(value)                 (US_LONL2HDR_PB_Msk & ((value) << US_LONL2HDR_PB_Pos))
#define US_LONL2HDR_Msk                       (0x000000FFUL)                                 /**< (US_LONL2HDR) Register Mask  */

/* -------- US_LONBL : (USART Offset: 0x70) (R/  32) LON Backlog Register -------- */
#define US_LONBL_LONBL_Pos                    (0U)                                           /**< (US_LONBL) LON Node Backlog Value Position */
#define US_LONBL_LONBL_Msk                    (0x3FU << US_LONBL_LONBL_Pos)                  /**< (US_LONBL) LON Node Backlog Value Mask */
#define US_LONBL_LONBL(value)                 (US_LONBL_LONBL_Msk & ((value) << US_LONBL_LONBL_Pos))
#define US_LONBL_Msk                          (0x0000003FUL)                                 /**< (US_LONBL) Register Mask  */

/* -------- US_LONB1TX : (USART Offset: 0x74) (R/W 32) LON Beta1 Tx Register -------- */
#define US_LONB1TX_BETA1TX_Pos                (0U)                                           /**< (US_LONB1TX) LON Beta1 Length after Transmission Position */
#define US_LONB1TX_BETA1TX_Msk                (0xFFFFFFU << US_LONB1TX_BETA1TX_Pos)          /**< (US_LONB1TX) LON Beta1 Length after Transmission Mask */
#define US_LONB1TX_BETA1TX(value)             (US_LONB1TX_BETA1TX_Msk & ((value) << US_LONB1TX_BETA1TX_Pos))
#define US_LONB1TX_Msk                        (0x00FFFFFFUL)                                 /**< (US_LONB1TX) Register Mask  */

/* -------- US_LONB1RX : (USART Offset: 0x78) (R/W 32) LON Beta1 Rx Register -------- */
#define US_LONB1RX_BETA1RX_Pos                (0U)                                           /**< (US_LONB1RX) LON Beta1 Length after Reception Position */
#define US_LONB1RX_BETA1RX_Msk                (0xFFFFFFU << US_LONB1RX_BETA1RX_Pos)          /**< (US_LONB1RX) LON Beta1 Length after Reception Mask */
#define US_LONB1RX_BETA1RX(value)             (US_LONB1RX_BETA1RX_Msk & ((value) << US_LONB1RX_BETA1RX_Pos))
#define US_LONB1RX_Msk                        (0x00FFFFFFUL)                                 /**< (US_LONB1RX) Register Mask  */

/* -------- US_LONPRIO : (USART Offset: 0x7C) (R/W 32) LON Priority Register -------- */
#define US_LONPRIO_PSNB_Pos                   (0U)                                           /**< (US_LONPRIO) LON Priority Slot Number Position */
#define US_LONPRIO_PSNB_Msk                   (0x7FU << US_LONPRIO_PSNB_Pos)                 /**< (US_LONPRIO) LON Priority Slot Number Mask */
#define US_LONPRIO_PSNB(value)                (US_LONPRIO_PSNB_Msk & ((value) << US_LONPRIO_PSNB_Pos))
#define US_LONPRIO_NPS_Pos                    (8U)                                           /**< (US_LONPRIO) LON Node Priority Slot Position */
#define US_LONPRIO_NPS_Msk                    (0x7FU << US_LONPRIO_NPS_Pos)                  /**< (US_LONPRIO) LON Node Priority Slot Mask */
#define US_LONPRIO_NPS(value)                 (US_LONPRIO_NPS_Msk & ((value) << US_LONPRIO_NPS_Pos))
#define US_LONPRIO_Msk                        (0x00007F7FUL)                                 /**< (US_LONPRIO) Register Mask  */

/* -------- US_IDTTX : (USART Offset: 0x80) (R/W 32) LON IDT Tx Register -------- */
#define US_IDTTX_IDTTX_Pos                    (0U)                                           /**< (US_IDTTX) LON Indeterminate Time after Transmission (comm_type = 1 mode only) Position */
#define US_IDTTX_IDTTX_Msk                    (0xFFFFFFU << US_IDTTX_IDTTX_Pos)              /**< (US_IDTTX) LON Indeterminate Time after Transmission (comm_type = 1 mode only) Mask */
#define US_IDTTX_IDTTX(value)                 (US_IDTTX_IDTTX_Msk & ((value) << US_IDTTX_IDTTX_Pos))
#define US_IDTTX_Msk                          (0x00FFFFFFUL)                                 /**< (US_IDTTX) Register Mask  */

/* -------- US_IDTRX : (USART Offset: 0x84) (R/W 32) LON IDT Rx Register -------- */
#define US_IDTRX_IDTRX_Pos                    (0U)                                           /**< (US_IDTRX) LON Indeterminate Time after Reception (comm_type = 1 mode only) Position */
#define US_IDTRX_IDTRX_Msk                    (0xFFFFFFU << US_IDTRX_IDTRX_Pos)              /**< (US_IDTRX) LON Indeterminate Time after Reception (comm_type = 1 mode only) Mask */
#define US_IDTRX_IDTRX(value)                 (US_IDTRX_IDTRX_Msk & ((value) << US_IDTRX_IDTRX_Pos))
#define US_IDTRX_Msk                          (0x00FFFFFFUL)                                 /**< (US_IDTRX) Register Mask  */

/* -------- US_ICDIFF : (USART Offset: 0x88) (R/W 32) IC DIFF Register -------- */
#define US_ICDIFF_ICDIFF_Pos                  (0U)                                           /**< (US_ICDIFF) IC Differentiator Number Position */
#define US_ICDIFF_ICDIFF_Msk                  (0xFU << US_ICDIFF_ICDIFF_Pos)                 /**< (US_ICDIFF) IC Differentiator Number Mask */
#define US_ICDIFF_ICDIFF(value)               (US_ICDIFF_ICDIFF_Msk & ((value) << US_ICDIFF_ICDIFF_Pos))
#define US_ICDIFF_Msk                         (0x0000000FUL)                                 /**< (US_ICDIFF) Register Mask  */

/* -------- US_WPMR : (USART Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define US_WPMR_WPEN_Pos                      (0U)                                           /**< (US_WPMR) Write Protection Enable Position */
#define US_WPMR_WPEN_Msk                      (0x1U << US_WPMR_WPEN_Pos)                     /**< (US_WPMR) Write Protection Enable Mask */
#define US_WPMR_WPEN(value)                   (US_WPMR_WPEN_Msk & ((value) << US_WPMR_WPEN_Pos))
#define US_WPMR_WPKEY_Pos                     (8U)                                           /**< (US_WPMR) Write Protection Key Position */
#define US_WPMR_WPKEY_Msk                     (0xFFFFFFU << US_WPMR_WPKEY_Pos)               /**< (US_WPMR) Write Protection Key Mask */
#define US_WPMR_WPKEY(value)                  (US_WPMR_WPKEY_Msk & ((value) << US_WPMR_WPKEY_Pos))
#define   US_WPMR_WPKEY_PASSWD_Val            (5591873U)                                     /**< (US_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define US_WPMR_WPKEY_PASSWD                  (US_WPMR_WPKEY_PASSWD_Val << US_WPMR_WPKEY_Pos) /**< (US_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define US_WPMR_Msk                           (0xFFFFFF01UL)                                 /**< (US_WPMR) Register Mask  */

/* -------- US_WPSR : (USART Offset: 0xE8) (R/  32) Write Protection Status Register -------- */
#define US_WPSR_WPVS_Pos                      (0U)                                           /**< (US_WPSR) Write Protection Violation Status Position */
#define US_WPSR_WPVS_Msk                      (0x1U << US_WPSR_WPVS_Pos)                     /**< (US_WPSR) Write Protection Violation Status Mask */
#define US_WPSR_WPVS(value)                   (US_WPSR_WPVS_Msk & ((value) << US_WPSR_WPVS_Pos))
#define US_WPSR_WPVSRC_Pos                    (8U)                                           /**< (US_WPSR) Write Protection Violation Source Position */
#define US_WPSR_WPVSRC_Msk                    (0xFFFFU << US_WPSR_WPVSRC_Pos)                /**< (US_WPSR) Write Protection Violation Source Mask */
#define US_WPSR_WPVSRC(value)                 (US_WPSR_WPVSRC_Msk & ((value) << US_WPSR_WPVSRC_Pos))
#define US_WPSR_Msk                           (0x00FFFF01UL)                                 /**< (US_WPSR) Register Mask  */

/** \brief USART register offsets definitions */
#define US_CR_OFFSET                   (0x00)         /**< (US_CR) Control Register Offset */
#define US_MR_OFFSET                   (0x04)         /**< (US_MR) Mode Register Offset */
#define US_IER_OFFSET                  (0x08)         /**< (US_IER) Interrupt Enable Register Offset */
#define US_IDR_OFFSET                  (0x0C)         /**< (US_IDR) Interrupt Disable Register Offset */
#define US_IMR_OFFSET                  (0x10)         /**< (US_IMR) Interrupt Mask Register Offset */
#define US_CSR_OFFSET                  (0x14)         /**< (US_CSR) Channel Status Register Offset */
#define US_RHR_OFFSET                  (0x18)         /**< (US_RHR) Receive Holding Register Offset */
#define US_THR_OFFSET                  (0x1C)         /**< (US_THR) Transmit Holding Register Offset */
#define US_BRGR_OFFSET                 (0x20)         /**< (US_BRGR) Baud Rate Generator Register Offset */
#define US_RTOR_OFFSET                 (0x24)         /**< (US_RTOR) Receiver Timeout Register Offset */
#define US_TTGR_OFFSET                 (0x28)         /**< (US_TTGR) Transmitter Timeguard Register Offset */
#define US_FIDI_OFFSET                 (0x40)         /**< (US_FIDI) FI DI Ratio Register Offset */
#define US_NER_OFFSET                  (0x44)         /**< (US_NER) Number of Errors Register Offset */
#define US_IF_OFFSET                   (0x4C)         /**< (US_IF) IrDA Filter Register Offset */
#define US_MAN_OFFSET                  (0x50)         /**< (US_MAN) Manchester Configuration Register Offset */
#define US_LINMR_OFFSET                (0x54)         /**< (US_LINMR) LIN Mode Register Offset */
#define US_LINIR_OFFSET                (0x58)         /**< (US_LINIR) LIN Identifier Register Offset */
#define US_LINBRR_OFFSET               (0x5C)         /**< (US_LINBRR) LIN Baud Rate Register Offset */
#define US_LONMR_OFFSET                (0x60)         /**< (US_LONMR) LON Mode Register Offset */
#define US_LONPR_OFFSET                (0x64)         /**< (US_LONPR) LON Preamble Register Offset */
#define US_LONDL_OFFSET                (0x68)         /**< (US_LONDL) LON Data Length Register Offset */
#define US_LONL2HDR_OFFSET             (0x6C)         /**< (US_LONL2HDR) LON L2HDR Register Offset */
#define US_LONBL_OFFSET                (0x70)         /**< (US_LONBL) LON Backlog Register Offset */
#define US_LONB1TX_OFFSET              (0x74)         /**< (US_LONB1TX) LON Beta1 Tx Register Offset */
#define US_LONB1RX_OFFSET              (0x78)         /**< (US_LONB1RX) LON Beta1 Rx Register Offset */
#define US_LONPRIO_OFFSET              (0x7C)         /**< (US_LONPRIO) LON Priority Register Offset */
#define US_IDTTX_OFFSET                (0x80)         /**< (US_IDTTX) LON IDT Tx Register Offset */
#define US_IDTRX_OFFSET                (0x84)         /**< (US_IDTRX) LON IDT Rx Register Offset */
#define US_ICDIFF_OFFSET               (0x88)         /**< (US_ICDIFF) IC DIFF Register Offset */
#define US_WPMR_OFFSET                 (0xE4)         /**< (US_WPMR) Write Protection Mode Register Offset */
#define US_WPSR_OFFSET                 (0xE8)         /**< (US_WPSR) Write Protection Status Register Offset */

